//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьДатаРождения(Парам01)","ЕстьДатаРождения","Допустим Есть дата рождения 01.01.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастВПолныхМесяцахРавен(Парам01)","ВозрастВПолныхМесяцахРавен","Тогда Возраст в полных месяцах равен 7");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим Есть дата рождения 01.01.2016
//@ЕстьДатаРождения(Парам01)
Процедура ЕстьДатаРождения(ДатаРождения) Экспорт
	Контекст.Вставить("ДатаРождения",ДатаРождения)
КонецПроцедуры

&НаКлиенте
//Тогда Возраст в полных месяцах равен 7
//@ВозрастВПолныхМесяцахРавен(Парам01)
Процедура ВозрастВПолныхМесяцахРавен(ОжидаемыйРезультат) Экспорт
	Результат = ОбщийМодуль2.ОпределитьРазницуДатВМесяцах(Контекст.ДатаРождения);
	Если Не Результат = ОжидаемыйРезультат Тогда 
		ВызватьИсключение "Возраст расчитан не верно";
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля